homework_7/problem_1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            outletInlet;
        nFaces          10;
        startFace       180;
    }
    right
    {
        type            inletOutlet;
        nFaces          10;
        startFace       190;
    }
    up
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          10;
        startFace       200;
    }
    down
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          10;
        startFace       210;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          200;
        startFace       220;
    }
)

// ************************************************************************* //
